renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_fwup/src/r_fwup.c
/*
* Copyright (c) 2023-2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/
/**********************************************************************************************************************
 * File Name    : r_fwup.c
 * Description  : Functions for the Firmware update module.
 **********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 31.03.2023 2.00    First Release
 *         : 20.11.2023 2.01    Fixed log messages.
 *                              Add parameter checking.
 *                              Added arguments to R_FWUP_WriteImageProgram API.
 *         : 18.04.2025 2.03    V203 Release.
 *         : 27.08.2025 2.04    V204 Release.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include "r_fwup_if.h"
#include "r_fwup_private.h"
#include "r_fwup_wrap_com.h"
#include "r_fwup_wrap_flash.h"
#include "r_fwup_wrap_verify.h"

/**********************************************************************************************************************
 Macro definitions
 *********************************************************************************************************************/
#define FWUP_READ_BUF_SIZE                     (128U)
#define FWUP_COPY_BUF_SIZE                     (FWUP_CFG_CF_W_UNIT_SIZE)
#define FWUP_VERI_BUF_SIZE                     (128U)
#define FWUP_WRITE_HEADER_BUF_SIZE             (128U)
#define FWUP_IMAGE_FLAG                        (0xFEU)
#define FWUP_HASH_BYTES                        (32U)


/* Buffer area */
#if (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT)
#define FWUP_BUF_AREA_ADDR_L                   (FWUP_CFG_EXT_BUF_AREA_ADDR_L)
#define FWUP_BUF_AREA_BLK_SIZE                 (FWUP_CFG_EXT_BUF_AREA_BLK_SIZE)
#define FWUP_BUF_AREA_NUM_BLKS                 (FWUP_CFG_AREA_SIZE / FWUP_BUF_AREA_BLK_SIZE)
#else
#define FWUP_BUF_AREA_ADDR_L                   (FWUP_CFG_BUF_AREA_ADDR_L)
#define FWUP_BUF_AREA_BLK_SIZE                 (FWUP_CFG_CF_BLK_SIZE)
#define FWUP_BUF_AREA_NUM_BLKS                 (FWUP_CFG_AREA_SIZE / FWUP_BUF_AREA_BLK_SIZE)
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT) */

/* Data flash */
#define FWUP_DF_BLK_SIZE                       (FWUP_CFG_DF_BLK_SIZE)
#define FWUP_DF_NUM_BLKS                       (FWUP_CFG_DF_NUM_BLKS)
#define FWUP_DF_NUM_BYTES                      (FWUP_DF_BLK_SIZE * FWUP_DF_NUM_BLKS)

/**********************************************************************************************************************
 Local Typedef definitions
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Exported global variables
 *********************************************************************************************************************/

/**********************************************************************************************************************
 Private (static) variables and functions
 *********************************************************************************************************************/
/*
 * functions
 */
static e_fwup_err_t check_initial_rcv (e_fwup_area_t area);
static bool check_magic_code (e_fwup_area_t area);
static uint32_t get_offset_from_install_area (uint32_t addr);
static bool check_addr_range (uint32_t addr);
static e_fwup_err_t write_image_header (e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t hdr_size);
static e_fwup_err_t write_image_prog (e_fwup_area_t area, uint8_t *p_buf, uint32_t buf_size);
static e_fwup_err_t write_image_offset_prog (e_fwup_area_t area, uint8_t *p_buf, uint32_t offset, uint32_t buf_size);
static e_fwup_err_t erase_area (e_fwup_area_t area);
static e_fwup_err_t write_area (e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t offset, uint32_t size);
static e_fwup_err_t write_area_offset (e_fwup_area_t area, uint8_t **p_buf, uint32_t *p_bufsz, uint32_t offset, uint32_t size, uint32_t *p_write_offset, uint32_t *p_write_size);
static void read_area (e_fwup_area_t area, uint32_t * p_buf, uint32_t area_offset, uint32_t size);
static e_fwup_err_t copy_to_main_area (void);
static int32_t sha256_update (e_fwup_area_t area, void * vp_ctx, uint32_t area_offset, uint32_t datalen);
static uint8_t * hash_sha256 (e_fwup_area_t area);
static uint32_t get_flash_write_addr(e_fwup_area_t area, uint32_t buf_sz_tmp, uint32_t rsu_offset, uint32_t *p_write_offset, uint32_t *p_write_address, uint32_t *p_write_size);

/*
 * variables
 */
/* Magic code */
#if (FWUP_CFG_FWUPV1_COMPATIBLE == 0)
S_C_CH_FAR BOOT_LOADER_MAGIC_CODE[] = "RELFWV2";
#else
S_C_CH_FAR BOOT_LOADER_MAGIC_CODE[] = "Renesas";
#endif

#if (FWUP_CFG_PRINTF_DISABLE == 0)
/* for debug logging */
S_C_CH_FAR MSG_MAIN[] = "main";
S_C_CH_FAR MSG_BUFFER[] = "buffer";
S_C_CH_FAR MSG_OK[] = "OK\r\n";
S_C_CH_FAR MSG_NG[] = "NG\r\n";
S_C_CH_FAR MSG_VERIFY_INSTALL_AREA[] = "verify install area %s [%s]...";
S_C_CH_FAR MSG_WRITE_OK[]    = "W 0x%lX, %d ... OK\r\n";
#endif /* (FWUP_CFG_PRINTF_DISABLE == 0) */

/* user program size */
static uint32_t s_image_size = 0;
static uint32_t s_write_current_size = 0;

/* Flags */
static uint8_t s_initial_rcv_flg = 0;
static uint8_t s_img_header_write_flg = 0;
static uint8_t s_prg_list_write_flg = 0;
static uint8_t s_img_prog_write_flg = 0;

/* wrote counter */
static uint32_t s_wrote_counter = 0;

/* Program data count in the RSU header information (used by the write_image_prog function) */
static uint8_t s_fw_wip_cnt = 0;
/* Program data count in the RSU header information (used by the write_image_offset_prog function) */
static uint8_t s_fw_wiop_cnt = 0;

