renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_fwup/src/r_fwup.c
/*
 * API
 */
/**********************************************************************************************************************
 * Function Name: R_FWUP_Open
 * Description  : Open r_fwup module
 * Arguments    : None
 * Return Value : FWUP_SUCCESS   : success
 *                FWUP_ERR_FLASH : flash open error
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_Open(void)
{
    /* Open internal flash */
    if (FWUP_SUCCESS != r_fwup_wrap_flash_open())
    {
        return (FWUP_ERR_FLASH);
    }

    s_image_size = 0;
    s_write_current_size = 0;
    s_initial_rcv_flg = 0;
    s_img_header_write_flg = 0;
    s_prg_list_write_flg = 0;
    s_img_prog_write_flg = 0;
    s_wrote_counter = 0;
    s_fw_wip_cnt = 0;
    s_fw_wiop_cnt = 0;

#if (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT)
    /* Open external flash */
    if (FWUP_SUCCESS != r_fwup_wrap_ext_flash_open())
    {
        return (FWUP_ERR_FLASH);
    }
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT) */

    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function R_FWUP_Open
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_Close
 * Description  : Close r_fwup module
 * Arguments    : None
 * Return Value : None
 *********************************************************************************************************************/
void R_FWUP_Close(void)
{
    /* Close internal flash */
    r_fwup_wrap_flash_close();

#if (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT)
    /* Close external flash */
    r_fwup_wrap_ext_flash_close();
#endif /* (FWUP_CFG_UPDATE_MODE == FWUP_SINGLE_BANK_W_BUFFER_EXT) */
}
/**********************************************************************************************************************
 End of function R_FWUP_Close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_IsExistImage
 * Description  : Check existing image program
 * Arguments    : area    : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 * Return Value : true    : image program is found
 *                false   : image program is not found
 *********************************************************************************************************************/
bool R_FWUP_IsExistImage(e_fwup_area_t area)
{
    /* Parameter check. */
    if ((FWUP_AREA_MAIN != area) && (FWUP_AREA_BUFFER != area))
    {
        return (false);
    }

    return (check_magic_code(area));
}
/**********************************************************************************************************************
 End of function R_FWUP_IsExistImage
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_EraseArea
 * Description  : Erasing area.
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
 * Return Value : FWUP_SUCCESS   : success
 *                FWUP_ERR_FLASH : flash erase error
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_EraseArea(e_fwup_area_t area)
{
    return (erase_area(area));
}
/**********************************************************************************************************************
 End of function R_FWUP_EraseArea
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_GetImageSize
 * Description  : Get image size
 * Arguments    : None
 * Return Value : 0     : calculating image size.
 *                other : image size
 *********************************************************************************************************************/
uint32_t R_FWUP_GetImageSize(void)
{
    /* Received Program list? */
    if (0 == s_prg_list_write_flg)
    {
        return (0);
    }
    return (s_image_size);
}
/**********************************************************************************************************************
 End of function R_FWUP_GetImageSize
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FWUP_WriteImageHeader
 * Description  : Write image header.
 * Arguments    : area             : FWUP_AREA_MAIN/FWUP_AREA_BUFFER
 *                p_sig_type       : signature type
 *                p_sig            : signature
 *                sig_size         : signature size
 * Return Value : FWUP_SUCCESS     : success
 *                FWUP_ERR_FLASH   : flash write error
 *                FWUP_ERR_FAILURE : invalid parameter
 *********************************************************************************************************************/
e_fwup_err_t R_FWUP_WriteImageHeader(e_fwup_area_t area, uint8_t FWUP_FAR *p_sig_type,
                                     uint8_t FWUP_FAR *p_sig, uint32_t sig_size)
{
    uint32_t buf[FWUP_WRITE_HEADER_BUF_SIZE / sizeof(uint32_t)] = {0};
    uint8_t *p_buf_tmp = (uint8_t *)buf;
    uint32_t bufsz_tmp = sizeof (buf);
    st_fw_header_t *p_hdr = (st_fw_header_t *)buf;

