renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_fwup/src/r_fwup.c
    if (1 == s_img_prog_write_flg)
    {
        s_image_size = 0;
        s_initial_rcv_flg = 0;
        s_prg_list_write_flg = 0;
        s_img_prog_write_flg = 0;
        s_write_current_size = 0;
    }
    return (ret_val);
}
/**********************************************************************************************************************
 End of function write_image_offset_prog
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: erase_area
* Description  : Erase designated install area.
* Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
* Return Value : FWUP_SUCCESS   : success
*                FWUP_ERR_FLASH : flash erase error
**********************************************************************************************************************/
static e_fwup_err_t erase_area(e_fwup_area_t area)
{
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t) = r_fwup_wrap_flash_erase;
    uint32_t addr = FWUP_CFG_MAIN_AREA_ADDR_L;
    uint32_t num_blk = (FWUP_CFG_AREA_SIZE / FWUP_CFG_CF_BLK_SIZE);

    switch(area)
    {
        case FWUP_AREA_BUFFER:
            addr = FWUP_BUF_AREA_ADDR_L;
            num_blk = FWUP_BUF_AREA_NUM_BLKS;
            pfunc = FWUP_FUNC_BUFFER_AREA_ERASE;
            break;
        case FWUP_AREA_DATA_FLASH:
            addr = FWUP_CFG_DF_ADDR_L;
            num_blk = FWUP_CFG_DF_NUM_BLKS;
            break;
        default:
            break;
    }
    return (pfunc(addr, num_blk));
}
/**********************************************************************************************************************
 End of function erase_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: write_area
 * Description  : Write firmware data to designated area.
 * Arguments    : area           : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
 *                p_buf:(i/o)    : (i)image data's pointer ,  (o)left buffer
 *                p_bufsz:(i/o)  : (i)buffer size,            (o)left buffer size
 *                offset         : write offset from install area. (not flash address!!!)
 *                size           : write size
 * Return Value : FWUP_SUCCESS   : done     (enough buffer)
 *                FWUP_PROGRESS  : progress (not enough buffer)
 *                FWUP_ERR_FLASH : flash write error
 *********************************************************************************************************************/
static e_fwup_err_t write_area(e_fwup_area_t area, uint8_t **p_buf,
                               uint32_t *p_bufsz, uint32_t offset, uint32_t size)
{
    uint32_t start_addr = FWUP_CFG_MAIN_AREA_ADDR_L + offset;
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t, uint32_t) = r_fwup_wrap_flash_write;
    uint32_t write_size_tmp;

    if (FWUP_AREA_BUFFER == area)
    {
        pfunc = FWUP_FUNC_BUFFER_AREA_WRITE;
        start_addr = FWUP_BUF_AREA_ADDR_L + offset;
    }
    else if (FWUP_AREA_DATA_FLASH == area)
    {
        start_addr = FWUP_CFG_DF_ADDR_L + offset;
    }
    else
    {
        ; /* Do nothing */
    }

    /* Is buffer enough? */
    if (size > (s_wrote_counter + (*p_bufsz)))
    {
        /* not enough */
        write_size_tmp = *p_bufsz;
    }
    else
    {
        /* enough */
        write_size_tmp = size - s_wrote_counter;
    }

    /* Write firmware */
    if (FWUP_SUCCESS != pfunc((uint32_t)*p_buf, start_addr + s_wrote_counter, write_size_tmp))
    {
        return (FWUP_ERR_FLASH);
    }
    FWUP_LOG_DBG(MSG_WRITE_OK, start_addr + s_wrote_counter, write_size_tmp);

    s_wrote_counter += write_size_tmp;
    *p_buf += write_size_tmp;
    *p_bufsz -= write_size_tmp;
    if (size > s_wrote_counter)
    {
        return (FWUP_PROGRESS);
    }

    s_wrote_counter = 0;
    return (FWUP_SUCCESS);
}
/**********************************************************************************************************************
 End of function write_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
* Function Name: read_area
* Description  : read data from main area / buffer area.
* Arguments    : area        : FWUP_AREA_MAIN/FWUP_AREA_BUFFER/FWUP_AREA_DATA_FLASH
*                p_buf       : buffer pointer
*                area_offset : FWUP_AREA_MAIN/FWUP_AREA_BUFFER : offset in area.
*                            : FWUP_AREA_DATA_FLASH : flash address
*                size        : read size
* Return Value : none
**********************************************************************************************************************/
static void read_area(e_fwup_area_t area, uint32_t * p_buf, uint32_t area_offset, uint32_t size)
{
    uint32_t flash_addr;
    e_fwup_err_t (*pfunc)(uint32_t, uint32_t, uint32_t) = r_fwup_wrap_flash_read;

    if (FWUP_AREA_MAIN == area)
    {
        flash_addr = area_offset + FWUP_CFG_MAIN_AREA_ADDR_L;
    }
    else if (FWUP_AREA_BUFFER == area)
    {
        pfunc = FWUP_FUNC_BUFFER_AREA_READ;
        flash_addr = area_offset + FWUP_BUF_AREA_ADDR_L;
    }
    else
    {
        /* Data flash */
        flash_addr = area_offset;
    }
    pfunc((uint32_t)p_buf, flash_addr, size);
}
/**********************************************************************************************************************
 End of function read_area
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: copy_to_main_area
 * Description  : Copy buffer area to main area
 * Arguments    : None
 * Return Value : FWUP_SUCCESS   : success
 *                FWUP_ERR_FLASH : flash error
 *********************************************************************************************************************/
static e_fwup_err_t copy_to_main_area(void)
{
#if (FWUP_CFG_UPDATE_MODE != FWUP_DUAL_BANK) && (FWUP_CFG_UPDATE_MODE != FWUP_SINGLE_BANK_WO_BUFFER)
    uint32_t    read_addr = 0;
    int32_t     block_cnt;
    uint32_t    max_cnt;
    uint32_t    cf_block[FWUP_COPY_BUF_SIZE / sizeof(uint32_t)];

